#include <iostream> 
#include <cmath>

using namespace std;

//================ПРОТОТИПИ Ф-ЦІЙ==================
double init(); // введення даних
double area(double); // розрахунок площ
void browse(double); // иведення результату 

//================ГОЛОВНА Ф-ЦІЯ====================
int main()
{
    setlocale(LC_ALL, "Ukr");
    cout << "Трачук Юлiя IС-01, Лабараторна №6" << endl;
    double e = init();// визов ф-ції введення і присвоєння Їй значення е 
    double result = area(e);// визов ф-ції розрахунку 
    browse(result);//визов ф-ції результату
    system("pause");
    return 0;

}
//================ВИЗНАЧЕННЯ Ф_ЦІЙ=================
double area(double e) // ф-ція розрахунку 
{
    double sum = 0; // значення початкової суми
    double x = 0; // початкове значення х
    while (2 / x * cos(x / 2) > exp(-pow(x, 2))) // ітераційний цикл (для обчислення суми площ усіх прямокутників на площині) 
    {
        if (exp(-pow(x, 2)) < log(1 + pow(x, 2))) // Провірка першої умови 
        {
            if  (log(1 + pow(x, 2)) < 2 / x * cos(x / 2)) // Провірка другої умови 
                sum += (log(1 + pow(x, 2)) - exp(-pow(x, 2))) * e; //Обрахунок виконання умов (сумування прямокутників, де е - ширина, різниця значень ф-цій у тоці х - довжина) 
            else     
                sum += (2 / x * cos(x / 2) - exp(-pow(x, 2))) * e; // Обрахунок за не виконання умови  (сумування прямокутників)
        }
        x += e; //збільшення х
    }
    return sum; //повернення значення суми
}

double init() // ф-ція введення 
{
    double e; // задана користувачем точність 
    cout << "Введiть точнiсть = "; cin >> e; //введення значення точності
    if (e <= 0)// умова, що була дана 
    {
        cout << "Для обрахунку площi введiть натуральне число " << endl; // виведення тексту за умови виконання 
        
    }
    return e;// повернення значення е 
}

void browse(double result) // ф-ція виведення результату
{
    cout << "Шукана площа: " << result << " (кв.одиниць)" << endl; // виведення шуканого значення 
}